# Задача 1.1.

# Есть строка с перечислением песен

my_favorite_songs = ('Потеряй мгновение, оставаясь в живых', 'Своего рода сказка', 'Начни меня', 'Новое спасение')
# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.





my_favorite_songs = (
'Потеряй мгновение оставаясь в живых' 
'Новое спасение' 
'Своего рода сказка' 
'Начни меня' )
    


print(my_favorite_songs[0:35])
print(my_favorite_songs[35:49])
print(my_favorite_songs[49:67])
print(my_favorite_songs[67:77])
    
